cnlohr/ch32v003fun/minichlink/minichlink.c
	MCF.FlushLLCommands( dev );

	if( timeout == max_timeout ) 
	{
		fprintf( stderr, "Timed out trying to unbrick\n" );
		return -5;
	}
	MCF.Erase( dev, 0, 0, 1);
	MCF.FlushLLCommands( dev );
	return -5;
}

int DefaultConfigureNRSTAsGPIO( void * dev, int one_if_yes_gpio  )
{
	fprintf( stderr, "Error: DefaultConfigureNRSTAsGPIO does not work via the programmer here.  Please see the demo \"optionbytes\"\n" );
	return -5;
#if 0
	int ret = 0;
	uint32_t csw;


	if( MCF.ReadWord( dev, 0x1FFFF800, &csw ) )
	{
		fprintf( stderr, "Error: failed to get user word\n" );
		return -5;
	}

	printf( "CSW WAS : %08x\n", csw );

	MCF.WriteWord( dev, 0x40022008, 0x45670123 ); // OBKEYR = 0x40022008
	MCF.WriteWord( dev, 0x40022008, 0xCDEF89AB );
	MCF.WriteWord( dev, 0x40022004, 0x45670123 ); // FLASH->KEYR = 0x40022004
	MCF.WriteWord( dev, 0x40022004, 0xCDEF89AB );
	MCF.WriteWord( dev, 0x40022024, 0x45670123 ); // MODEKEYR = 0x40022024
	MCF.WriteWord( dev, 0x40022024, 0xCDEF89AB );

//XXXX THIS DOES NOT WORK IT CANNOT ERASE.
	uint32_t ctlr;
	if( MCF.ReadWord( dev, 0x40022010, &ctlr ) ) // FLASH->CTLR = 0x40022010
	{
		return -9;
	}
	ctlr |= CR_OPTER_Set | CR_STRT_Set; // OBER
	MCF.WriteWord( dev, 0x40022010, ctlr ); // FLASH->CTLR = 0x40022010
	ret |= MCF.WaitForDoneOp( dev );
	ret |= MCF.WaitForFlash( dev );

	MCF.WriteHalfWord( dev, (intptr_t)&OB->RDPR, RDP_Key );

    ctlr &=~CR_OPTER_Reset;
	MCF.WriteWord( dev, 0x40022010, ctlr ); // FLASH->CTLR = 0x40022010
	ret |= MCF.WaitForDoneOp( dev );
	ret |= MCF.WaitForFlash( dev );
    ctlr |= CR_OPTPG_Set;
	MCF.WriteWord( dev, 0x40022010, ctlr ); // FLASH->CTLR = 0x40022010
	ret |= MCF.WaitForDoneOp( dev );
	ret |= MCF.WaitForFlash( dev );
    ctlr &=~CR_OPTPG_Reset;
	MCF.WriteWord( dev, 0x40022010, ctlr ); // FLASH->CTLR = 0x40022010
	ret |= MCF.WaitForDoneOp( dev );
	ret |= MCF.WaitForFlash( dev );


// This does work to write the option bytes, but does NOT work to erase.

	if( MCF.ReadWord( dev, 0x40022010, &ctlr ) ) // FLASH->CTLR = 0x40022010
	{
		return -9;
	}
	ctlr |= CR_OPTPG_Set; //OBPG
	MCF.WriteWord( dev, 0x40022010, ctlr ); // FLASH->CTLR = 0x40022010
	ret |= MCF.WaitForDoneOp( dev );
	ret |= MCF.WaitForFlash( dev );

	uint32_t config = OB_IWDG_HW | OB_STOP_NoRST | OB_STDBY_NoRST | (one_if_yes_gpio?OB_RST_NoEN:OB_RST_EN_DT1ms) | (uint16_t)0xE0;
	printf( "Config (%08x): %08x\n", (intptr_t)&OB->USER, config );
	MCF.WriteHalfWord( dev,  (intptr_t)&OB->USER, config );

	ret |= MCF.WaitForDoneOp( dev );
	ret |= MCF.WaitForFlash( dev );

	ctlr &= CR_OPTPG_Reset;
	MCF.WriteWord( dev, 0x40022010, ctlr ); // FLASH->CTLR = 0x40022010


	if( MCF.ReadWord( dev, 0x1FFFF800, &csw ) )
	{
		fprintf( stderr, "Error: failed to get user word\n" );
		return -5;
	}

	//csw >>= 16; // Only want bottom part of word.
	printf( "CSW: %08x\n", csw );

#if 0
	uint32_t prevuser;
	if( MCF.ReadWord( dev, 0x1FFFF800, &prevuser ) )
	{
		fprintf( stderr, "Error: failed to get user word\n" );
		return -5;
	}

	ret |= MCF.WaitForFlash( dev );

	// Erase.
	MCF.ReadWord( dev, 0x40022010, &csw ); // FLASH->CTLR = 0x40022010
	csw |= 1<<5;//OBER;
	MCF.WriteWord( dev, 0x40022010, csw ); // FLASH->CTLR = 0x40022010
	MCF.WriteHalfWord( dev, 0x1FFFF802, 0xffff );
	ret |= MCF.WaitForDoneOp( dev );
	ret |= MCF.WaitForFlash( dev );

	MCF.ReadWord( dev, 0x40022010, &csw ); // FLASH->CTLR = 0x40022010
	printf( "CTLR: %08x\n", csw );
	csw |= 1<<9;//OBPG, OBWRE
	MCF.WriteWord( dev, 0x40022010, csw );

	int j;
	for( j = 0; j < 5; j++ )
	{
		if( MCF.ReadWord( dev, 0x1FFFF800, &prevuser ) )
		{
			fprintf( stderr, "Error: failed to get user word\n" );
			return -5;
		}

		//csw >>= 16; // Only want bottom part of word.
		printf( "CSW was: %08x\n", prevuser );
		csw = prevuser >> 16;
		csw = csw & 0xe7e7;
		csw |= (one_if_yes_gpio?0b11:0b00)<<(3+0);
		csw |= (one_if_yes_gpio?0b00:0b11)<<(3+8);
		printf( "CSW writing: %08x\n", csw );
		MCF.WriteHalfWord( dev, 0x1FFFF802, csw );
		ret |= MCF.WaitForDoneOp( dev );
		ret |= MCF.WaitForFlash( dev );
	}


	MCF.ReadWord( dev, 0x40022010, &csw ); // FLASH->CTLR = 0x40022010
	printf( "CTLR: %08x\n", csw );
	csw &= ~(1<<9);//OBPG, OBWRE
	MCF.WriteWord( dev, 0x40022010, csw );

#endif
	printf( "RET: %d\n", ret );
	return 0;
#endif
}

int DefaultPrintChipInfo( void * dev )
{
	uint32_t reg;
	MCF.HaltMode( dev, 0 );

	if( MCF.ReadWord( dev, 0x1FFFF800, &reg ) ) goto fail;	
	printf( "USER/RDPR: %08x\n", reg );
/*	if( MCF.ReadWord( dev, 0x1FFFF804, &reg ) ) goto fail;	
	printf( "NDATA: %08x\n", reg );
	if( MCF.ReadWord( dev, 0x1FFFF808, &reg ) ) goto fail;	
	printf( "WRPR01: %08x\n", reg );
	if( MCF.ReadWord( dev, 0x1FFFF80c, &reg ) ) goto fail;	
	printf( "WRPR23: %08x\n", reg );*/
	if( MCF.ReadWord( dev, 0x1FFFF7E0, &reg ) ) goto fail;
	printf( "Flash Size: %d kB\n", (reg&0xffff) );
	if( MCF.ReadWord( dev, 0x1FFFF7E8, &reg ) ) goto fail;	
	printf( "R32_ESIG_UNIID1: %08x\n", reg );
	if( MCF.ReadWord( dev, 0x1FFFF7EC, &reg ) ) goto fail;	
	printf( "R32_ESIG_UNIID2: %08x\n", reg );
	if( MCF.ReadWord( dev, 0x1FFFF7F0, &reg ) ) goto fail;	
	printf( "R32_ESIG_UNIID3: %08x\n", reg );
	return 0;
fail:
	fprintf( stderr, "Error: Failed to get chip details\n" );
	return -11;
}

int DefaultVoidHighLevelState( void * dev )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	iss->statetag = STTAG( "VOID" );
	return 0;
}

int SetupAutomaticHighLevelFunctions( void * dev )
{
	// Will populate high-level functions from low-level functions.
	if( MCF.WriteReg32 == 0 || MCF.ReadReg32 == 0 ) return -5;

	// Else, TODO: Build the high level functions from low level functions.
	// If a high-level function alrady exists, don't override.
	
	if( !MCF.SetupInterface )
		MCF.SetupInterface = DefaultSetupInterface;
	if( !MCF.WriteBinaryBlob )
		MCF.WriteBinaryBlob = DefaultWriteBinaryBlob;
	if( !MCF.ReadBinaryBlob )
		MCF.ReadBinaryBlob = DefaultReadBinaryBlob;
	if( !MCF.WriteWord )
		MCF.WriteWord = DefaultWriteWord;
	if( !MCF.WriteHalfWord )
		MCF.WriteHalfWord = DefaultWriteHalfWord;
	if( !MCF.ReadCPURegister )
		MCF.ReadCPURegister = DefaultReadCPURegister;
	if( !MCF.WriteCPURegister )
		MCF.WriteCPURegister = DefaultWriteCPURegister;
	if( !MCF.WriteAllCPURegisters )
		MCF.WriteAllCPURegisters = DefaultWriteAllCPURegisters;
	if( !MCF.ReadAllCPURegisters )
		MCF.ReadAllCPURegisters = DefaultReadAllCPURegisters;
	if( !MCF.SetEnableBreakpoints )
		MCF.SetEnableBreakpoints = DefaultSetEnableBreakpoints;
	if( !MCF.ReadWord )
		MCF.ReadWord = DefaultReadWord;
	if( !MCF.ReadHalfWord )
		MCF.ReadHalfWord = DefaultReadHalfWord;
	if( !MCF.Erase )
		MCF.Erase = DefaultErase;
	if( !MCF.HaltMode )
		MCF.HaltMode = DefaultHaltMode;
	if( !MCF.PollTerminal )
		MCF.PollTerminal = DefaultPollTerminal;
	if( !MCF.WaitForFlash )
		MCF.WaitForFlash = DefaultWaitForFlash;
	if( !MCF.WaitForDoneOp )
		MCF.WaitForDoneOp = DefaultWaitForDoneOp;
	if( !MCF.PrintChipInfo )
		MCF.PrintChipInfo = DefaultPrintChipInfo;
	if( !MCF.Unbrick )
		MCF.Unbrick = DefaultUnbrick;
	if( !MCF.ConfigureNRSTAsGPIO )
		MCF.ConfigureNRSTAsGPIO = DefaultConfigureNRSTAsGPIO;
	if( !MCF.VoidHighLevelState )
		MCF.VoidHighLevelState = DefaultVoidHighLevelState;

	struct InternalState * iss = malloc( sizeof( struct InternalState ) );
	iss->statetag = 0;
	iss->currentstateval = 0;
	iss->autoincrement = 0;

	((struct ProgrammerStructBase*)dev)->internal = iss;
	return 0;
}




